steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static QueueDownloadResult downloadQueuePhotoBin(Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  if (cfg.delivery_mode == "inktime_offline_schedule") {
    // Enhanced offline schedules are consumed only from the signed schedule
    // endpoint; the generic queue can never select an arbitrary first item.
    return QueueDownloadResult::EmptyOrUnsupported;
  }
#endif
  String base;
  if (!normalizedBackendBase(cfg, base)) return QueueDownloadResult::Failed;

  inktime::DeviceHttpTransport manifestTransport(cfg.ca_pem);
  HTTPClient manifestHttp;
  String manifestTransportCode;
  String manifestTransportMessage;
  const char* manifestHeaders[] = {"Content-Type"};
  manifestHttp.collectHeaders(manifestHeaders, 1);
  if (!manifestTransport.begin(
        manifestHttp, base + String(DEVICE_QUEUE_MANIFEST_PATH), 30000,
        manifestTransportCode, manifestTransportMessage)) {
    lastDeviceErrorCode = manifestTransportCode.length() ? manifestTransportCode : "DEVICE-QUEUE-URL";
    lastDeviceErrorMessage = manifestTransportMessage.length() ? manifestTransportMessage : "Queue Manifest URL 無法初始化";
    return QueueDownloadResult::Failed;
  }
  manifestHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int status = manifestHttp.GET();
  if (status == HTTP_CODE_NOT_FOUND) {
    manifestHttp.end();
    return QueueDownloadResult::EmptyOrUnsupported;
  }
  const int manifestLength = manifestHttp.getSize();
  const String contentType = manifestHttp.header("Content-Type");
  if (status != HTTP_CODE_OK || manifestLength <= 0
      || manifestLength > static_cast<int>(inktime::kQueueManifestMaxBytes)
      || !contentType.startsWith("application/json")) {
    manifestHttp.end();
    lastDeviceErrorCode = "DEVICE-QUEUE-HTTP";
    lastDeviceErrorMessage = "Queue Manifest HTTP／Content-Type／長度不合法";
    return QueueDownloadResult::Failed;
  }

  JsonDocument manifest;
  const DeserializationError jsonError = deserializeJson(manifest, manifestHttp.getStream());
  manifestHttp.end();
  const JsonVariantConst schema = manifest["schema_version"];
  const JsonVariantConst version = manifest["queue_version"];
  const JsonVariantConst rawItems = manifest["items"];
  if (jsonError || manifest.overflowed() || !schema.is<int32_t>() || schema.is<bool>()
      || schema.as<int32_t>() != 1 || !version.is<int32_t>() || version.is<bool>()
      || version.as<int32_t>() < 0 || !rawItems.is<JsonArrayConst>()) {
    lastDeviceErrorCode = "DEVICE-QUEUE-SCHEMA";
    lastDeviceErrorMessage = "Queue Manifest schema、version 或 items 不合法";
    return QueueDownloadResult::Failed;
  }
  const JsonArrayConst items = rawItems.as<JsonArrayConst>();
  if (items.size() == 0U) return QueueDownloadResult::EmptyOrUnsupported;
  if (items.size() > 14U) {
    lastDeviceErrorCode = "DEVICE-QUEUE-COUNT";
    lastDeviceErrorMessage = "Queue Item 數量超過裝置上限";
    return QueueDownloadResult::Failed;
  }

  String selectedItemId;
  String selectedReleaseId;
  String selectedSha;
  String selectedDownloadUrl;
  String selectedPixelFormat;
  String selectedRenderProfile;
  int64_t selectedSize = 0;
#if INKTIME_PHOTOPAINTER_ENABLED
  bool selected = false;
  const bool enhancedOffline = cfg.delivery_mode == "inktime_offline_schedule";
#endif
  for (size_t index = 0; index < items.size(); ++index) {
    const JsonVariantConst rawItem = items[index];
    if (!rawItem.is<JsonObjectConst>()) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ITEM";
      lastDeviceErrorMessage = "Queue Item 必須是 JSON object";
      return QueueDownloadResult::Failed;
    }
    const JsonObjectConst item = rawItem.as<JsonObjectConst>();
    const JsonVariantConst rawSize = item["size"];
    const JsonVariantConst rawWidth = item["width"];
    const JsonVariantConst rawHeight = item["height"];
    if (!rawSize.is<int64_t>() || rawSize.is<bool>() || !rawWidth.is<int32_t>()
        || rawWidth.is<bool>() || !rawHeight.is<int32_t>() || rawHeight.is<bool>()) {
      lastDeviceErrorCode = "DEVICE-QUEUE-INTEGER";
      lastDeviceErrorMessage = "Queue size／width／height 必須是真正 JSON integer";
      return QueueDownloadResult::Failed;
    }
    String itemId = item["queue_item_id"] | "";
    String releaseId = item["release_id"] | "";
    String sha = item["sha256"] | "";
    String downloadUrl = item["download_url"] | "";
    String pixelFormat = item["pixel_format"] | "";
    String renderProfile = item["render_profile"] | "";
#if INKTIME_PHOTOPAINTER_ENABLED
    const JsonVariantConst rawOfflinePrefetch = item["offline_prefetch_allowed"];
    if (!rawOfflinePrefetch.isNull()
        && (!rawOfflinePrefetch.is<bool>() || rawOfflinePrefetch.is<int>())) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ITEM";
      lastDeviceErrorMessage = "offline_prefetch_allowed 必須是真正 JSON boolean";
      return QueueDownloadResult::Failed;
    }
    const bool offlinePrefetchAllowed = rawOfflinePrefetch | false;
    const String deliveryMode = item["delivery_mode"] | "online_queue";
#endif
    const int64_t size = rawSize.as<int64_t>();
    const inktime::QueueItemContract contract = {
      itemId.c_str(), releaseId.c_str(), sha.c_str(), downloadUrl.c_str(), true, size,
    };
    const bool compatibleProfile = renderProfile == "safe_4c"
      || renderProfile == String(INKTIME_PANEL_PROFILE);
    if (!inktime::validQueueItem(contract) || rawWidth.as<int32_t>() != FB_WIDTH
        || rawHeight.as<int32_t>() != FB_HEIGHT
        || (pixelFormat != "2bpp" && pixelFormat != "indexed4")
        || !compatibleProfile) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ITEM";
      lastDeviceErrorMessage = "Queue Item 身分、SHA、路徑、尺寸或 Profile 不合法";
      return QueueDownloadResult::Failed;
    }
#if INKTIME_PHOTOPAINTER_ENABLED
    if (enhancedOffline && (deliveryMode != "offline_schedule" || !offlinePrefetchAllowed)) {
      continue;
    }
    if (!selected) {
#else
    if (index == 0U) {
#endif
      selectedItemId = itemId;
      selectedReleaseId = releaseId;
      selectedSha = sha;
      selectedDownloadUrl = downloadUrl;
      selectedPixelFormat = pixelFormat;
      selectedRenderProfile = renderProfile;
      selectedSize = size;
#if INKTIME_PHOTOPAINTER_ENABLED
      selected = true;
#endif
    }
  }

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!selected) return QueueDownloadResult::EmptyOrUnsupported;
#endif

  currentFromQueue = true;
  currentQueueItemId = selectedItemId;
  currentQueueVersion = version.as<int32_t>();
  currentReleaseId = selectedReleaseId;
  currentRenderProfile = selectedRenderProfile;
  currentPayloadSha256 = selectedSha;
  currentPayloadShaVerified = false;
  currentPayloadIntegrityTrusted = false;
  currentDisplaySkipped = false;
  if (!sendQueueEvent(cfg, inktime::QueueEvent::ManifestReceived)) {
    return QueueDownloadResult::Failed;
  }

